Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.MessageExecutionModeEnum Enumeration
 The message execution modes of Tekla Structures.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum MessageExecutionModeEnum
Public Enumeration MessageExecutionModeEnum
Members
Member name | Value | Description
INSTANT | 0 |  Executes messages after each database operation. All objects appear instantly on the screen when using the INSTANT mode.
BY_COMMIT | 1 |  Executes messages only when Drawing.CommitChanges() is called.
Remarks
The message execution mode of Tekla Structures controls whether messages are executed after each database operation or by an explicit call to execute messages.
There may be some speed benefits if the BY_COMMIT mode is used when inserting a lot of objects. The messages are then executed once after the objects have been inserted.
See Also
Reference
Tekla.Structures.Drawing Namespace